<?php

return [

    'title' => 'Для наших клиентов доступны следующие варианты оплаты заказа:',

    'method_cash_title' => "Оплата\nналичными",
    'method_cash_text' => 'Вы всегда можете выбрать вариант оплаты наличными при самовывозе в нашем магазине',

    'method_card_title' => "Перевод\nна банковскую карту",
    'method_card_text' => 'После оформления и согласования заказа наши менеджеры предоставят удобные для вас реквизиты',

    'method_sbp_title' => 'Оплата по СБП — QR Code',
    'method_sbp_text' => 'После подтверждения заказа вы получите QR-код для быстрой и удобной оплаты через СБП',

    'method_currency_title' => 'Оплата в других валютах',
    'method_currency_text' => 'Просто попросите менеджера и он расскажет все детально',

    'contact_title' => 'По вопросам доставки и оплаты:',
    'contact_phone' => '+7 (985) 449-8000',
    'contact_email' => 'info@bronber.com',

];
