<?php

return [

    'title' => 'Возврат и обмен',

    'subtitle_non_returnable' => 'Перечень товаров, не подлежащих возврату и обмену, утверждён Постановлением Правительства от 31.12.2020 №2463.',

    'subtitle_defective' => 'Возврат или обмен товара ненадлежащего качества',

    'body_1' => 'В соответствии с действующим законодательством, Вы можете произвести возврат или обмен товара надлежащего качества в течении 14-ти календарных дней не считая дня покупки. Причиной возврата или обмена товара может быть следующее: товар не подошел по размеру, габаритам, своим свойствам, расцветке или комплектации. В некоторых случаях мы идём навстречу нашим клиентам, и можем принять товар к обмену или возврату в более поздний срок. Каждый случай рассматривается отдельно, и согласовывается с менеджером по работе с клиентами.',

    'body_2' => 'Перед обращением убедитесь, что товар подлежит возврату или обмену. Вы можете вернуть или обменять товар надлежащего качества, если он сохранил товарный вид и свои потребительские свойства. На товаре не должно быть следов эксплуатации и использования. При этом у товара должна быть оригинальная и неповрежденная упаковка (в том числе не повреждена производственная маркировка и ярлыки). Товары приобретенные в нашем магазине со следами их установки, применения технических жидкостей (масло/топливо) – возврату или обмену не подлежат.',

    'body_3' => "В него входят моторные и трансмиссионные масла, топливные присадки, смазки, комплекты для обслуживания воздушных фильтров, тормозная жидкость. Так же в этот перечень входят технически сложные товары:\nкатушки и свечи зажигания,\nтопливные насосы,\nлямбда зонд широкополосный,\nэлектро вентиляторы.\nДанные товары обмену и возврату не подлежат.\n\nСогласуйте с нашим менеджером наиболее удобный для Вас способ возврата или обмена товара. Вы можете лично привезти товар в наш магазин находящийся по адресу Москва, 14-й проезд Марьиной рощи 1А, либо воспользоваться услугами курьерской службы или транспортной компании.",

    'body_4' => 'Производитель даёт гарантию на производственный брак. Все товары проходят предпродажную проверку. Вероятность того, что Вы получите товар ненадлежащего качества, сведена к минимуму. Мы настоятельно рекомендуем производить установку в квалифицированных организациях имеющих опыт монтажа и эксплуатации подобных товаров. Как показывает наша многолетняя практика, потеря эксплуатационных свойств товара происходит в результате грубейших нарушений условий эксплуатации. Так же проблемы с товаром могут возникнуть при неправильном монтаже и нецелевом использовании. Каждый случай обнаружения такого товара рассматривается индивидуально, и мы прилагаем максимальные усилия для решения вопроса в пользу клиента.',

];
