<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые строки аутентификации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки используются при аутентификации для различных
    | сообщений, которые необходимо показать пользователю. Вы можете свободно
    | изменять эти строки в соответствии с требованиями вашего приложения.
    |
    */

    'failed' => 'Эти учётные данные не соответствуют нашим записям.',
    'password' => 'Указан неверный пароль.',
    'throttle' => 'Слишком много попыток входа. Пожалуйста, попробуйте снова через :seconds секунд.',
];
