<?php

declare(strict_types=1);

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые строки пагинации
    |--------------------------------------------------------------------------
    |
    | Следующие языковые строки используются библиотекой пагинатора для построения
    | простых ссылок пагинации. Вы можете свободно изменить их на любые,
    | чтобы настроить отображение под ваше приложение.
    |
    */

    'showing' => 'Показано',
    'of' => 'из',
    'to' => '—',
    'results' => 'записей',
    'previous' => '&laquo; Назад',
    'next' => 'Вперёд &raquo;',

];
